In [3]:
from urllib.parse import quote_plus

import pandas as pd
from sqlalchemy import create_engine

username = quote_plus("root")
password = quote_plus("password")
server = "host.docker.internal:3306"
db_name = "testdb"

conn = create_engine(
    f"mysql+pymysql://{username}:{password}@{server}/{db_name}",
).connect()

In [4]:
#第一個參數放sql語法，第二個放連線
df = pd.read_sql(
    "select * from staff",
    conn,
)

df

    ID  Name DeptId  Age Gender  Salary            recordDt
0  001  Mike    002   45      M   60000 2020-04-24 14:59:57

In [5]:
#從資料庫拿出來的資料跟資料庫裡定義的會相同
df.dtypes

ID                  object
Name                object
DeptId              object
Age                  int64
Gender              object
Salary               int64
recordDt    datetime64[ns]
dtype: object

In [6]:
df["ID"] = df["ID"].apply(lambda x: x.replace("00", "01"))
df

    ID  Name DeptId  Age Gender  Salary            recordDt
0  011  Mike    002   45      M   60000 2020-04-24 14:59:57

In [7]:
df.to_sql(
    "staff",
    conn,
    if_exists="append",
    index=False
)

1